# **Intro to Datascience**

#### *Database*

*It is a piece of software that stores and manages data*

*SQL - Structure Query language*

**Datascience Flow chart**

<img src="flowchart.png" alt="Flowchart" width="800px">

***List of common databases:***

- MySQL
- sqllite
- Oracle
- Postgres
- Neo4j

### **Data Manipulation Tools in python**

- Numpy
- Pandas

### **Data Visualization Tools in python**

- Matplotlib
- Seaborne

### **ML Algorithm package in python**

- Scipy 
- Scikit Learn

## *MySQL*

***Installing configuring MySQL database***
- *Download from this [link](https://dev.mysql.com/downloads/file/?id=514518)*
- *Install MySQL on your personal Computer by following this [Video](https://www.youtube.com/watch?v=IqYfmckxeyE)*
- *Configure Username as `root`*
- *Configure Password as `root@123`*

***Operations in MySQL***

*CRUD - Create Read Update Delete*

### Data Definition Language(DDL)

1. CREATE
2. ALTER
3. DROP
4. TRUNCATE

### Data Manipulation Language(DML)

1. SELECT
2. INSERT
3. UPDATE
4. DELETE

### SQL QUERY

```
USE     world       ;
 |         |        |
command  arguments semicolon
```

```
USE world;

-- show all the tables inside the database.
SHOW tables;

-- select command select the specific column, use * if we need select all column
SELECT * FROM city;
SELECT ID, Name, District FROM city;

-- filtering in mysql Where
SELECT * FROM city WHERE CountryCode="IND" AND Name="Delhi";
SELECT * FROM city WHERE population > 2000000;

SELECT * FROM countrylanguage;

SELECT * FROM countrylanguage WHERE IsOfficial = "T" AND CountryCode = "IND";

SELECT * FROM countrylanguage WHERE IsOfficial="T";

-- Functions in SQL
SELECT avg(population) FROM city;

SELECT * FROM city WHERE population > 350468;

SELECT count(ID) FROM city;

SELECT count(CountryCode) FROM city;

SELECT count(distinct CountryCode) FROM city;

SELECT ID, Name, District, length(Name) AS "Name_Length" FROM city;

SELECT concat(Name, District, population) AS "Concat_namedistrict", Name, District FROM city;

SELECT upper(District), District FROM city;

SELECT lower(District), District FROM city;
```

### Data Types in MySQL

1. Numeric
   1. Int = -214783648 to 214783647
   2. Bigint 
   3. Tinyint = -128 to 127
   4. Float = decimal
2. String
   1. Char = char(5) eg: kamal = 0 to 255
   2. varchar = varchar(size) _ 0 to 65535
   3. Text = length constrain is not applicable
3. DateTime
   1. Date - "2001-12-03" "yyyy-mm-dd" 
   2. Time - "10:23:54" "HH:MM:SS"
   3. Datetime - "2001-12-03 10:23:54" _ "yyyy-mm-dd HH:MM:SS"
   4. Timestamp - "2001-12-03 10:23:54 UTC"

```
# Create a dtabase in MySQL

CREATE DATABASE School;

USE school;

# Create a table in MySQL
CREATE TABLE class(Name char(30), Section char(1), Tutor_name char(30), Student_count int, Class_start_date date);

SHOW TABLES;

# Inserting values into table
INSERT INTO class(Name, Section, Tutor_name, Student_count, Class_start_date) values("Surya", "B", "Ajay", 57, "2002-10-20");

INSERT INTO class(Name, Section, Tutor_name, Class_start_date) values("Prakash", "B", "Ajay", "2002-10-20");

SELECT * FROM class;

# Altering the table
ALTER TABLE class ADD(Class_end_date date);
ALTER TABLE class MODIFY COLUMN Tutor_name Char(100);
ALTER TABLE class DROP COLUMN Class_end_date;
ALTER TABLE class RENAME COLUMN New_name TO Tutor_name;
```

"9:00" < work_start_time < "10:00"

"9:00" < work_start_time AND "10:00" > work_start_time

### Constraint in MySQL

1. Primary key - unique for each row
2. unique - not allow duplicate value
3. Not null - not allow null values
4. auto increment - auto increment values
5. Check - validates input before saving table
6. default - change default to user specified value
7. Foreign Key - links one table to another

```
-- Truncate the table
Use school;

select * from class;

Truncate table class;

-- Drop in mysql

Drop table class;

-- update table
UPDATE class SET Tutor_name = "Gopi" WHERE Name = "Surya";
UPDATE class SET Student_count = 59 WHERE Tutor_name = "Suresh";
UPDATE class SET Student_count = 55 WHERE Section = "B";


-- Delete from Table
DELETE FROM class WHERE Name = "Ramesh";
DELETE FROM class WHERE class_start_date > "2002-10-21";
```

```
-- Constraints in MySQL

CREATE TABLE student_list(
Id int Primary key auto_increment,  Name char(100) default "Unknown Name", Age int check (Age > 10) , Section char(1) NOT NULL
);

drop table employee;

INSERT INTO student_list(Name, Age, Section) Values("Arjun", 14, "A"), ("Prakash", 15, "C");

INSERT INTO student_list(Age, Section) Values(16, "A");

INSERT INTO student_list(Name, Age, Section) Values("Praveen", 9, "A");

INSERT INTO student_list(Name, Age) Values("Praveen", 12);

INSERT INTO student_list(ID, Name, Age, Section) Values(3, "Praveen", 13, "A");
```

# 26-11-2022

```
USE company;

drop table student;

show Tables;

create table class(class_id int primary key auto_increment, Standard char(30) , Section char(1));

Alter table class drop column Name;
alter table class modify column Standard char(30);

Create table Student(
student_id int primary key auto_increment, 
Name char(60), 
age int, 
joining_date date default "2022-11-26", 
class_id int,  foreign key (class_id) references class(class_id));

INSERT INTO class(standard, section) value("8th", "A"), ("8th", "B"), ("8th", "C"), ("9th", "A"), ("9th", "B");

select * from class;

INSERT INTO student(Name, age, class_id) values("Prem", 12, 2), ("Ramesh", 17, 1);

select * from student;

select * from student as s inner join class as c on c.class_id = s.class_id;

-- SQL ADVANCED FUNCTIONS

USE world;

show tables;

select * from city;

select countrycode, sum(population) as Tot_pop from city group by countrycode;

select * from countrylanguage;


SELECT language, sum(percentage) as sum_perc from countrylanguage where isofficial = 'T' group by language having sum_perc < 20 order by language asc;


select * from city where name like "K%";


select population/population from  city;

use world;

select * from city where name like "%ar%";

select * from countrylanguage;


select countrycode, language, percentage, isofficial from countrylanguage where countrycode!="USA" and percentage = 100 and language = "English";
 
 
 
 
 
```

### JOINS IN MySQL

<img src="./join.png" width=800px height=500px>


```
-- INNER JOIN, OUTER JOIN, RIGHT and LEFT JOIN
INSERT INTO city(Name, Countrycode, District, population) values("New Name", "XYZ", "New district", 12345678);

SELECT 
    *
FROM
    city AS c
        INNER JOIN
    country AS ctr ON ctr.Code = c.countrycode;

SELECT 
    count(*)
FROM
    city AS c
		JOIN
    country AS ctr ON ctr.Code = c.countrycode;
    
SELECT 
    count(*)
FROM
    city AS c
		LEFT JOIN
    country AS ctr ON ctr.Code = c.countrycode;
    
SELECT 
    *
FROM
    city AS c
        RIGHT JOIN
    country AS ctr ON ctr.code = c.CountryCode;


select * from country where Code = "ATF";
select * from City where CountryCode = "ATF";


SELECT COUNT(*) FROM COUNTRY AS CTR INNER JOIN COUNTRYLANGUAGE AS CL ON CTR.CODE=CL.COUNTRYCODE group by COUNTRYCODE;

-- outer join
SELECT 
    *
FROM
    city AS c
        RIGHT JOIN
    country AS ctr ON ctr.code = c.CountryCode
UNION
SELECT 
    *
FROM
    city AS c
		LEFT JOIN
    country AS ctr ON ctr.Code = c.countrycode;
```